# coding: utf-8

UserAgents = {
	"RU": "ru-RU",
	"UA": "ua-UA",
	"EN": "en-US"
			}

if DefLANG in ("RU", "UA"):
	AllwebAnsBase = tuple([line.decode("utf-8") for line in (
		"Не могу получить доступ к странице.", # 0
		"Проблемы с разметкой...", # 1
		"Твоих запросов нет в базе.", # 2
		"Не вижу твоего JID'а, поэтому не могу найти твоих запросов в базе.", # 3
		"\n\n** Ещё %d результатов (командуй «гугл *»).", # 4
		"Ничего не найдено...", # 5
		"Запрос блокирован Кинопоиском." # -1
					)])

	Currency_desc = {
		"AMD": "Армянский драм",
		"AUD": "Австралийский доллар ($)",
		"AZN": "Азербайджанский манат",
		"BGN": "Болгарский лев",
		"BRL": "Бразильский реал",
		"BYR": "Белорусский рубль",
		"CAD": "Канадский доллар",
		"CHF": "Швейцарский франк (₣)",
		"CNY": "Китайский юань",
		"CZK": "Чешская крона",
		"DKK": "Датская крона",
		"EUR": "Евро (€)",
		"GBP": "Фунт стерлингов Соединенного королевства (£)",
		"HUF": "Венгерский форинт",
		"INR": "Индийская рупия",
		"JPY": "Японская йена (¥)",
		"KGS": "Киргизский сом",
		"KRW": "Вон Республики Корея",
		"KZT": "Казахский тенге",
		"LTL": "Литовский лит",
		"LVL": "Латвийский лат",
		"MDL": "Молдавская лея",
		"NOK": "Норвежская крона",
		"PLN": "Польская злотая",
		"RON": "Новая Румынская лея",
		"RUB": "Российский рубль",
		"SEK": "Шведская крона",
		"SGD": "Сингапурский доллар",
		"TJS": "Таджикская сомони",
		"TMT": "Новый туркменский манат",
		"TRY": "Турецкая лира (£)",
		"UAH": "Украинская гривна",
		"USD": "Доллар США ($)",
		"UZS": "Узбекский сум",
		"XDR": "Специальные права заимствования (¤)",
		"ZAR": "Южноафриканский рэнд"
					}
else:
	AllwebAnsBase = (
		"No access to the page.", # 0
		"Trouble with the marking...", # 1
		"There are no your requests in cache.", # 2
		"I can't find your requests in cache, because I don't know your JID.", # 3
		'\n\n** There are %d another results (type "google *").', # 4
		"No result..." # 5
					)